<a href="https://colab.research.google.com/github/coder20910/Machine-Learning/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Exercise

# Importing Libraries

In [2]:
import numpy as np
import pandas as pd

# Operations on data

In [3]:
dict1 = {
    "name":['Chandan','Sumit','Ajay','Manohar'],
    "marks":[92,92,92,92],
    "city":['Aurangabad','Muzzafarpur','Bhagalpur','Madhubani']
}

In [4]:
df = pd.DataFrame(dict1)   # Converts into dataframe

In [5]:
df

      name  marks         city
0  Chandan     92   Aurangabad
1    Sumit     92  Muzzafarpur
2     Ajay     92    Bhagalpur
3  Manohar     92    Madhubani

# Conversion of Dataframe to CSV

In [6]:
df.to_csv('Friends')  # Converts into CSV file

In [7]:
df.head(2)        # Display the first two rows of whole dataframe

      name  marks         city
0  Chandan     92   Aurangabad
1    Sumit     92  Muzzafarpur

In [8]:
df.tail(2)          # Display the last two rows of whole datafram

      name  marks       city
2     Ajay     92  Bhagalpur
3  Manohar     92  Madhubani

In [9]:
df.describe()    # It will do statistics analysis

       marks
count    4.0
mean    92.0
std      0.0
min     92.0
25%     92.0
50%     92.0
75%     92.0
max     92.0

# Reading CSV File

In [10]:
friends = pd.read_csv('Friends')

In [11]:
friends

   Unnamed: 0     name  marks         city
0           0  Chandan     92   Aurangabad
1           1    Sumit     92  Muzzafarpur
2           2     Ajay     92    Bhagalpur
3           3  Manohar     92    Madhubani

In [12]:
friends['marks'][0] = 93    # It wiil change the value

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [13]:
friends

   Unnamed: 0     name  marks         city
0           0  Chandan     93   Aurangabad
1           1    Sumit     92  Muzzafarpur
2           2     Ajay     92    Bhagalpur
3           3  Manohar     92    Madhubani

In [14]:
friends.index = ['first', 'second', 'third','fourth'] # Changing the index name

In [15]:
friends

        Unnamed: 0     name  marks         city
first            0  Chandan     93   Aurangabad
second           1    Sumit     92  Muzzafarpur
third            2     Ajay     92    Bhagalpur
fourth           3  Manohar     92    Madhubani

# Generation of Random data using concept of series

In [16]:
ser = pd.Series(np.random.rand(34)) # It will generate n random series data

In [17]:
ser

0     0.769195
1     0.087066
2     0.927788
3     0.784230
4     0.035202
5     0.047602
6     0.241563
7     0.912974
8     0.914640
9     0.499412
10    0.677156
11    0.141162
12    0.122718
13    0.205489
14    0.730353
15    0.388965
16    0.719744
17    0.117346
18    0.427982
19    0.885331
20    0.398939
21    0.473543
22    0.428096
23    0.670268
24    0.187495
25    0.286628
26    0.448448
27    0.622910
28    0.751595
29    0.906512
30    0.931856
31    0.405689
32    0.374261
33    0.480486
dtype: float64

In [18]:
type(ser)

pandas.core.series.Series

# Generation of DataFrame

In [19]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334)) # It will generate n x m random dataFra,e

In [20]:
newdf

            0         1         2         3         4
0    0.780563  0.665998  0.305865  0.760740  0.473353
1    0.395723  0.766573  0.992259  0.628542  0.311650
2    0.268596  0.040377  0.494291  0.967130  0.193529
3    0.338216  0.707649  0.217794  0.158542  0.873896
4    0.456514  0.525456  0.790216  0.601927  0.844689
..        ...       ...       ...       ...       ...
329  0.463314  0.230378  0.561559  0.699623  0.222213
330  0.630390  0.630176  0.764641  0.610893  0.812103
331  0.280055  0.556596  0.733664  0.615917  0.530238
332  0.016227  0.733768  0.922315  0.918100  0.793854
333  0.831791  0.735859  0.010889  0.768371  0.953172

[334 rows x 5 columns]

# Important attributes and fun's

In [21]:
type(newdf)

pandas.core.frame.DataFrame

In [22]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [23]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [24]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [25]:
newdf.to_numpy() # Conversion of dataframe to numpy array

array([[0.78056257, 0.66599848, 0.30586507, 0.76073956, 0.47335314],
       [0.39572346, 0.76657318, 0.99225872, 0.6285418 , 0.31165039],
       [0.26859612, 0.04037673, 0.49429144, 0.96712981, 0.19352913],
       ...,
       [0.2800549 , 0.55659577, 0.73366437, 0.61591742, 0.53023785],
       [0.01622743, 0.73376782, 0.92231455, 0.91809955, 0.79385422],
       [0.83179079, 0.7358587 , 0.01088867, 0.76837086, 0.95317156]])

In [26]:
newdf.T # Transpose of numpy array

        0         1         2    ...       331       332       333
0  0.780563  0.395723  0.268596  ...  0.280055  0.016227  0.831791
1  0.665998  0.766573  0.040377  ...  0.556596  0.733768  0.735859
2  0.305865  0.992259  0.494291  ...  0.733664  0.922315  0.010889
3  0.760740  0.628542  0.967130  ...  0.615917  0.918100  0.768371
4  0.473353  0.311650  0.193529  ...  0.530238  0.793854  0.953172

[5 rows x 334 columns]

In [27]:
newdf.head()

          0         1         2         3         4
0  0.780563  0.665998  0.305865  0.760740  0.473353
1  0.395723  0.766573  0.992259  0.628542  0.311650
2  0.268596  0.040377  0.494291  0.967130  0.193529
3  0.338216  0.707649  0.217794  0.158542  0.873896
4  0.456514  0.525456  0.790216  0.601927  0.844689

In [28]:
newdf.sort_index(axis=0, ascending=False)  # Sorting dataFrame in Descending order

            0         1         2         3         4
333  0.831791  0.735859  0.010889  0.768371  0.953172
332  0.016227  0.733768  0.922315  0.918100  0.793854
331  0.280055  0.556596  0.733664  0.615917  0.530238
330  0.630390  0.630176  0.764641  0.610893  0.812103
329  0.463314  0.230378  0.561559  0.699623  0.222213
..        ...       ...       ...       ...       ...
4    0.456514  0.525456  0.790216  0.601927  0.844689
3    0.338216  0.707649  0.217794  0.158542  0.873896
2    0.268596  0.040377  0.494291  0.967130  0.193529
1    0.395723  0.766573  0.992259  0.628542  0.311650
0    0.780563  0.665998  0.305865  0.760740  0.473353

[334 rows x 5 columns]

In [29]:
newdf.head()

          0         1         2         3         4
0  0.780563  0.665998  0.305865  0.760740  0.473353
1  0.395723  0.766573  0.992259  0.628542  0.311650
2  0.268596  0.040377  0.494291  0.967130  0.193529
3  0.338216  0.707649  0.217794  0.158542  0.873896
4  0.456514  0.525456  0.790216  0.601927  0.844689

In [30]:
newdf2 = newdf # It will point to the newdf(It is the view only.)

In [31]:
newdf2 = newdf # It will copy all the data.

In [32]:
newdf.loc[0,0] = 98 # Valid way to edit the data.

In [33]:
newdf.head()

           0         1         2         3         4
0  98.000000  0.665998  0.305865  0.760740  0.473353
1   0.395723  0.766573  0.992259  0.628542  0.311650
2   0.268596  0.040377  0.494291  0.967130  0.193529
3   0.338216  0.707649  0.217794  0.158542  0.873896
4   0.456514  0.525456  0.790216  0.601927  0.844689

In [34]:
newdf.drop(0,axis=0)

            0         1         2         3         4
1    0.395723  0.766573  0.992259  0.628542  0.311650
2    0.268596  0.040377  0.494291  0.967130  0.193529
3    0.338216  0.707649  0.217794  0.158542  0.873896
4    0.456514  0.525456  0.790216  0.601927  0.844689
5    0.990061  0.697335  0.188028  0.335889  0.733429
..        ...       ...       ...       ...       ...
329  0.463314  0.230378  0.561559  0.699623  0.222213
330  0.630390  0.630176  0.764641  0.610893  0.812103
331  0.280055  0.556596  0.733664  0.615917  0.530238
332  0.016227  0.733768  0.922315  0.918100  0.793854
333  0.831791  0.735859  0.010889  0.768371  0.953172

[333 rows x 5 columns]

In [35]:
 newdf.loc[[1,2],[0,1]]

          0         1
1  0.395723  0.766573
2  0.268596  0.040377

In [36]:
newdf.loc[(newdf[0]<0.3)]     # It will query all the values lesser than 0.3 in column 1

            0         1         2         3         4
2    0.268596  0.040377  0.494291  0.967130  0.193529
7    0.199619  0.943094  0.353045  0.608277  0.681442
8    0.270278  0.210176  0.860863  0.919926  0.691280
10   0.070478  0.020762  0.431127  0.906775  0.664769
12   0.085819  0.674698  0.769087  0.674407  0.575580
..        ...       ...       ...       ...       ...
325  0.060928  0.620698  0.461254  0.859391  0.669687
326  0.078162  0.074972  0.995380  0.687150  0.801369
327  0.189419  0.761112  0.252371  0.859323  0.036863
331  0.280055  0.556596  0.733664  0.615917  0.530238
332  0.016227  0.733768  0.922315  0.918100  0.793854

[101 rows x 5 columns]

In [38]:
newdf.loc[(newdf[0]<0.3) & (newdf[2]>0.1)]

            0         1         2         3         4
2    0.268596  0.040377  0.494291  0.967130  0.193529
7    0.199619  0.943094  0.353045  0.608277  0.681442
8    0.270278  0.210176  0.860863  0.919926  0.691280
10   0.070478  0.020762  0.431127  0.906775  0.664769
12   0.085819  0.674698  0.769087  0.674407  0.575580
..        ...       ...       ...       ...       ...
325  0.060928  0.620698  0.461254  0.859391  0.669687
326  0.078162  0.074972  0.995380  0.687150  0.801369
327  0.189419  0.761112  0.252371  0.859323  0.036863
331  0.280055  0.556596  0.733664  0.615917  0.530238
332  0.016227  0.733768  0.922315  0.918100  0.793854

[92 rows x 5 columns]

In [39]:
newdf.iloc[0,4]    # iloc is used to search values according to the index value 
                    #while loc is used to search values according to the name of the index

0.4733531386842632

In [42]:
newdf.iloc[[0,5],[1,2]]

          1         2
0  0.665998  0.305865
5  0.697335  0.188028

In [45]:
newdf.head(3)

           0         1         2         3         4
0  98.000000  0.665998  0.305865  0.760740  0.473353
1   0.395723  0.766573  0.992259  0.628542  0.311650
2   0.268596  0.040377  0.494291  0.967130  0.193529

In [44]:
newdf.drop(0)    # The data of the column 1 will be dropped but 
                # not inside the original dataframe

            0         1         2         3         4
1    0.395723  0.766573  0.992259  0.628542  0.311650
2    0.268596  0.040377  0.494291  0.967130  0.193529
3    0.338216  0.707649  0.217794  0.158542  0.873896
4    0.456514  0.525456  0.790216  0.601927  0.844689
5    0.990061  0.697335  0.188028  0.335889  0.733429
..        ...       ...       ...       ...       ...
329  0.463314  0.230378  0.561559  0.699623  0.222213
330  0.630390  0.630176  0.764641  0.610893  0.812103
331  0.280055  0.556596  0.733664  0.615917  0.530238
332  0.016227  0.733768  0.922315  0.918100  0.793854
333  0.831791  0.735859  0.010889  0.768371  0.953172

[333 rows x 5 columns]

In [47]:
newdf.drop([0,3],axis=1,inplace=True)   # Here dataframe of origninal array will be dropped

In [48]:
newdf

            1         2         4
0    0.665998  0.305865  0.473353
1    0.766573  0.992259  0.311650
2    0.040377  0.494291  0.193529
3    0.707649  0.217794  0.873896
4    0.525456  0.790216  0.844689
..        ...       ...       ...
329  0.230378  0.561559  0.222213
330  0.630176  0.764641  0.812103
331  0.556596  0.733664  0.530238
332  0.733768  0.922315  0.793854
333  0.735859  0.010889  0.953172

[334 rows x 3 columns]

In [50]:
newdf.reset_index(drop=True)  # It is used to reset index removing index column

     index         1         2         4
0        0  0.665998  0.305865  0.473353
1        1  0.766573  0.992259  0.311650
2        2  0.040377  0.494291  0.193529
3        3  0.707649  0.217794  0.873896
4        4  0.525456  0.790216  0.844689
..     ...       ...       ...       ...
329    329  0.230378  0.561559  0.222213
330    330  0.630176  0.764641  0.812103
331    331  0.556596  0.733664  0.530238
332    332  0.733768  0.922315  0.793854
333    333  0.735859  0.010889  0.953172

[334 rows x 4 columns]

In [51]:
newdf[1] = None # It will set to none in column 1

In [52]:
newdf

        1         2         4
0    None  0.305865  0.473353
1    None  0.992259  0.311650
2    None  0.494291  0.193529
3    None  0.217794  0.873896
4    None  0.790216  0.844689
..    ...       ...       ...
329  None  0.561559  0.222213
330  None  0.764641  0.812103
331  None  0.733664  0.530238
332  None  0.922315  0.793854
333  None  0.010889  0.953172

[334 rows x 3 columns]

In [53]:
newdf[1].isnull()  # It will return true if value is null

0      True
1      True
2      True
3      True
4      True
       ...
329    True
330    True
331    True
332    True
333    True
Name: 1, Length: 334, dtype: bool

In [54]:
newdf.loc[:,[1]] = 56

In [55]:
newdf

      1         2         4
0    56  0.305865  0.473353
1    56  0.992259  0.311650
2    56  0.494291  0.193529
3    56  0.217794  0.873896
4    56  0.790216  0.844689
..   ..       ...       ...
329  56  0.561559  0.222213
330  56  0.764641  0.812103
331  56  0.733664  0.530238
332  56  0.922315  0.793854
333  56  0.010889  0.953172

[334 rows x 3 columns]

In [59]:
df1 = pd.DataFrame({"name":["Alfred","Batman","Ironman"],
                    "tony":[np.nan,"Batmobile","Bullwhip"],
                    "born":[pd.NaT, pd.Timestamp("1940-04-25"),pd.NaT]})

In [61]:
df1

      name       tony       born
0   Alfred        NaN        NaT
1   Batman  Batmobile 1940-04-25
2  Ironman   Bullwhip        NaT

In [63]:
df1.dropna()   # 'Na' containig all values will be dropped if any

     name       tony       born
1  Batman  Batmobile 1940-04-25

In [64]:
df1.dropna(how='all') # if all  is 'Na' then table is dropped

      name       tony       born
0   Alfred        NaN        NaT
1   Batman  Batmobile 1940-04-25
2  Ironman   Bullwhip        NaT

In [68]:
df1 = pd.DataFrame({"name":["Alfred","Batman","Alfred"],
                    "tony":[np.nan,"Batmobile","Bullwhip"],
                    "born":[pd.NaT, pd.Timestamp("1940-04-25"),pd.NaT]})

In [69]:
df1.drop_duplicates(subset=['name'])  # All duplicates in name column will be deleted

     name       tony       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [73]:
df1.drop_duplicates(subset=['name'],keep='last')  # All duplicates in name column will be deleted except last

     name       tony       born
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

# Some important functions

In [71]:
df1.shape # It will show the size of dataframe

(3, 3)

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [75]:
df1['name'].value_counts(dropna=False)

Alfred    2
Batman    1
Name: name, dtype: int64

In [77]:
df1.isnull()

    name   tony   born
0  False   True   True
1  False  False  False
2  False  False   True